# **Carga de dados, armazenagem e formatos de arquivo**

## **Lendo e salvando arquivos csv:**

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([['um', 'a', 1, 2], ['um', 'b', 3, 4], ['um','c', 5, 6], ['um','d', 7, 8], ['dois','a', 9, 10], ['dois','b', 11, 12], ['dois', 'c', 13, 14],['dois', 'd', 15, 16]], 
                 columns = ['chave1', 'chave2', 'valor1', 'valor2'])
df.to_csv('/content/drive/MyDrive/Data Science/Python para Analise de Dados/df.csv', index=False, header=True)

**Escolhendo a coluna na ordem que eu determinar:**

In [3]:
df2 = pd.read_csv('/content/drive/MyDrive/Data Science/Python para Analise de Dados/df.csv', sep=',', index_col= ['chave1', 'chave2'])
df2

               valor1  valor2
chave1 chave2
um     a            1       2
       b            3       4
       c            5       6
       d            7       8
dois   a            9      10
       b           11      12
       c           13      14
       d           15      16

**Pulando linhas:**

In [4]:
df3 = pd.read_csv('/content/drive/MyDrive/Data Science/Python para Analise de Dados/df.csv', sep=',', skiprows= [0, 6])
df3

     um  a   1   2
0    um  b   3   4
1    um  c   5   6
2    um  d   7   8
3  dois  a   9  10
4  dois  c  13  14
5  dois  d  15  16

**Definindo quantas linhas o arquivo vai aparecer:**

In [5]:
df4 = pd.read_csv('/content/drive/MyDrive/Data Science/Python para Analise de Dados/df.csv', sep=',', nrows=3)
df4

  chave1 chave2  valor1  valor2
0     um      a       1       2
1     um      b       3       4
2     um      c       5       6

**Obs: Tamb√©m √© poss√≠vel colocar diferentes separadores. Nesse caso stdout d√° um print na express√£o**

In [6]:
import sys

In [7]:
df4.to_csv(sys.stdout, sep='|')

|chave1|chave2|valor1|valor2
0|um|a|1|2
1|um|b|3|4
2|um|c|5|6

**N√£o apenas df's podem ser convertidos pra outro formato, mas Series tamb√©m:**

In [8]:
datas = pd.date_range('08/08/1997', periods=10)
calendario = pd.Series(np.arange(1, 11), index=datas)
calendario

1997-08-08     1
1997-08-09     2
1997-08-10     3
1997-08-11     4
1997-08-12     5
1997-08-13     6
1997-08-14     7
1997-08-15     8
1997-08-16     9
1997-08-17    10
Freq: D, dtype: int64

**Salvando series em diversos formatos:**

In [9]:
calendario.to_csv('/content/drive/MyDrive/Data Science/Python para Analise de Dados/calendario.csv', index=False)
calendario.to_json('/content/drive/MyDrive/Data Science/Python para Analise de Dados/calendario.json')
calendario.to_excel('/content/drive/MyDrive/Data Science/Python para Analise de Dados/calendario.xlsx')

In [10]:
import csv
random = open('/content/drive/MyDrive/Data Science/Python para Analise de Dados/Files/random.csv', )
arquivo = csv.reader(random, delimiter='|', quotechar='"', lineterminator='\n', quoting = csv.QUOTE_MINIMAL)

In [11]:
for x in arquivo:
  print(x)

['\ufeff"feathers"', 'yourself', 'correct', 'queen', 'extra', 'girl', 'condition', 'enjoy', 'instead', 'nearest']
['teach', 'famous', 'success', 'inch', 'getting', 'three', 'flew', 'finger', 'nice', 'still']
['when', 'movie', 'heavy', 'view', 'stay', 'mean', 'white', 'raw', 'calm', 'tea']
['jungle', 'none', 'box', 'relationship', 'volume', 'given', 'effect', 'labor', 'lips', 'asleep']
['second', 'want', 'look', 'slope', 'branch', 'fly', 'scale', 'worker', 'blank', 'lips']
['ordinary', 'dot', 'copper', 'pine', 'let', 'shown', 'yellow', 'football', 'children', 'suppose']
['official', 'cross', 'sale', 'teeth', 'without', 'central', 'familiar', 'draw', 'fix', 'danger']
['waste', 'primitive', 'solve', 'noun', 'college', 'breath', 'came', 'including', 'health', 'victory']
['master', 'memory', 'action', 'death', 'week', 'laugh', 'get', 'no', 'library', 'away']
['say', 'swimming', 'hour', 'ground', 'cut', 'again', 'purpose', 'given', 'shelter', 'short']
['temperature', 'mirror', 'day', 'love', 'own', 'cloud', 'village', 'won', 'substance', 'immediately']

In [12]:
with open('/content/drive/MyDrive/Data Science/Python para Analise de Dados/Files/random.csv') as random:
  lines = list(csv.reader(random))
  header, values = lines[0], lines[1:]

data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'\ufeff"feathers"|"yourself"|"correct"|"queen"|"extra"|"girl"|"condition"|"enjoy"|"instead"|"nearest"': ('teach|"famous"|"success"|"inch"|"getting"|"three"|"flew"|"finger"|"nice"|"still"',
  'when|"movie"|"heavy"|"view"|"stay"|"mean"|"white"|"raw"|"calm"|"tea"',
  'jungle|"none"|"box"|"relationship"|"volume"|"given"|"effect"|"labor"|"lips"|"asleep"',
  'second|"want"|"look"|"slope"|"branch"|"fly"|"scale"|"worker"|"blank"|"lips"',
  'ordinary|"dot"|"copper"|"pine"|"let"|"shown"|"yellow"|"football"|"children"|"suppose"',
  'official|"cross"|"sale"|"teeth"|"without"|"central"|"familiar"|"draw"|"fix"|"danger"',
  'waste|"primitive"|"solve"|"noun"|"college"|"breath"|"came"|"including"|"health"|"victory"',
  'master|"memory"|"action"|"death"|"week"|"laugh"|"get"|"no"|"library"|"away"',
  'say|"swimming"|"hour"|"ground"|"cut"|"again"|"purpose"|"given"|"shelter"|"short"',
  'temperature|"mirror"|"day"|"love"|"own"|"cloud"|"village"|"won"|"substance"|"immediately"')}

In [13]:
class my_dialect(csv.Dialect):
  lineterminator = '\n'
  delimiter = ';'
  quotechar = '"'
  quoting = csv.QUOTE_MINIMAL
reader = csv.reader(arquivo, dialect=my_dialect)

In [14]:
!cat examples/ex7.csv

cat: examples/ex7.csv: No such file or directory

In [15]:
random1 = pd.read_table('/content/drive/MyDrive/Data Science/Python para Analise de Dados/Files/random.csv', sep='|')
random1

      feathers   yourself  correct  ...      enjoy    instead      nearest
0        teach     famous  success  ...     finger       nice        still
1         when      movie    heavy  ...        raw       calm          tea
2       jungle       none      box  ...      labor       lips       asleep
3       second       want     look  ...     worker      blank         lips
4     ordinary        dot   copper  ...   football   children      suppose
5     official      cross     sale  ...       draw        fix       danger
6        waste  primitive    solve  ...  including     health      victory
7       master     memory   action  ...         no    library         away
8          say   swimming     hour  ...      given    shelter        short
9  temperature     mirror      day  ...        won  substance  immediately

[10 rows x 10 columns]

## **Trabalhando com *JSONS*:**

In [16]:
JSON = pd.read_json('/content/drive/MyDrive/Data Science/Python para Analise de Dados/generated.json')
JSON.head()

                        _id  ...  favoriteFruit
0  60d4f8cb838bfdfbe65ac8c3  ...         banana
1  60d4f8cbc76c4553f90ef163  ...          apple
2  60d4f8cbb173544b52bd29dc  ...     strawberry
3  60d4f8cb29592322b9b3283f  ...         banana
4  60d4f8cb2ff7425a609a853a  ...         banana

[5 rows x 22 columns]

### **Convertendo Jsons para python:**

In [17]:
obj = """
{"nome": "Eduardo",
"lugares_viveu": ["Brasil", "Japao", "Ucrania"],
"pet": null,
"siblings": [{"Nome": "Icaro", "Idade": 30, "pets": ["Zeus", "Zuleika"]},
{"Nome": "Katarina", "Idade": 38,
"pets": ["Chico", "Bolhudo", "Jonnatan"]}]
}
"""

In [18]:
import json
json_python = json.loads(obj)
json_python

{'lugares_viveu': ['Brasil', 'Japao', 'Ucrania'],
 'nome': 'Eduardo',
 'pet': None,
 'siblings': [{'Idade': 30, 'Nome': 'Icaro', 'pets': ['Zeus', 'Zuleika']},
  {'Idade': 38, 'Nome': 'Katarina', 'pets': ['Chico', 'Bolhudo', 'Jonnatan']}]}

**Filtrando items e construindo DF de JSONS:**

In [19]:
irmaos = pd.DataFrame(json_python['siblings'], columns=['Nome', 'Idade'])
irmaos

       Nome  Idade
0     Icaro     30
1  Katarina     38

**Convertendo objeto Python para JSON:**

In [20]:
python_json = json.dumps(json_python)
python_json

'{"nome": "Eduardo", "lugares_viveu": ["Brasil", "Japao", "Ucrania"], "pet": null, "siblings": [{"Nome": "Icaro", "Idade": 30, "pets": ["Zeus", "Zuleika"]}, {"Nome": "Katarina", "Idade": 38, "pets": ["Chico", "Bolhudo", "Jonnatan"]}]}'

## **Trabalhando com dados HTML/XML:**

**Obs: Quando voc√™ faz scraping, ele retorna uma lista de DF**

In [21]:
html = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')
np.shape(html)

(1, 563, 7)

In [22]:
 type(html)

list

In [23]:
len(html)

1

In [24]:
falhas = html[0]
np.shape(falhas)

(563, 7)

In [25]:
falhas

                         Bank NameBank  ... FundFund
0                    Almena State Bank  ...    10538
1           First City Bank of Florida  ...    10537
2                 The First State Bank  ...    10536
3                   Ericson State Bank  ...    10535
4     City National Bank of New Jersey  ...    10534
..                                 ...  ...      ...
558                 Superior Bank, FSB  ...     6004
559                Malta National Bank  ...     4648
560    First Alliance Bank & Trust Co.  ...     4647
561  National State Bank of Metropolis  ...     4646
562                   Bank of Honolulu  ...     4645

[563 rows x 7 columns]

### **Tratando os dados HTML:**

In [26]:
falhas.head()

                      Bank NameBank  ... FundFund
0                 Almena State Bank  ...    10538
1        First City Bank of Florida  ...    10537
2              The First State Bank  ...    10536
3                Ericson State Bank  ...    10535
4  City National Bank of New Jersey  ...    10534

[5 rows x 7 columns]

In [27]:
falencia = pd.to_datetime(falhas['Closing DateClosing'])
falencia.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2017      8
2015      8
2016      5
2004      4
2001      4
2020      4
2019      4
2003      3
2007      3
2000      2
Name: Closing DateClosing, dtype: int64

### **Trabalhando com dados XML:**

In [28]:
from lxml import objectify

In [29]:
path = '/content/drive/MyDrive/Data Science/Python para Analise de Dados/Files/arquivo3.xml'
arquivo1 = objectify.parse(open(path))
root = arquivo1.getroot()

data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES', 'YEAR']

for elt in root:
  el_data = {}
  for child in elt.getchildren():
    if child.tag in skip_fields:
      continue
    el_data[child.tag] = child.pyval
data.append(el_data)

In [30]:
perf = pd.DataFrame(data)
perf.head()

            AGENCY_NAME          INDICATOR_NAME  ... MONTHLY_TARGET  MONTHLY_ACTUAL
0  Metro-North Railroad  Escalator Availability  ...           97.0

[1 rows x 12 columns]

In [31]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

root.get('href')

'http://www.google.com'

In [32]:
root.text

'Google'

##**Trabalhando com bin√°rios:**

Uma das formas mais simples de armazenar dados (tamb√©m
conhecida como serializa√ß√£o) de modo eficiente em formato bin√°rio √© usando a serializa√ß√£o embutida pickle de Python. Serializa√ß√£o e Desserializa√ß√£o s√£o mecanismos usados em muitos ambientes quando voc√™ precisa converter qualquer objeto  para algo que voc√™ pode colocar ‚Äúfora‚Äù do seu aplicativo.  Esta convers√£o pode ser em ambos os sentidos, e √© muito conveniente se voc√™ precisar salvar ou transferir dados (Ex: Criar um arquivo ‚Äúexporta√ß√£o‚Äù / ‚Äúbackup‚Äù em um projeto, etc).

In [33]:
picles = calendario.to_pickle('/content/drive/MyDrive/Data Science/Python para Analise de Dados/calendario_pickle')

In [34]:
pd.read_pickle('/content/drive/MyDrive/Data Science/Python para Analise de Dados/calendario_pickle')

1997-08-08     1
1997-08-09     2
1997-08-10     3
1997-08-11     4
1997-08-12     5
1997-08-13     6
1997-08-14     7
1997-08-15     8
1997-08-16     9
1997-08-17    10
Freq: D, dtype: int64

### **Arquivos Feather: Extremamente r√°pidos para DF's**

In [35]:
feather = df.to_feather('/content/drive/MyDrive/Data Science/Python para Analise de Dados/df.feather')
feather

In [36]:
pd.read_feather('/content/drive/MyDrive/Data Science/Python para Analise de Dados/df.feather')

  chave1 chave2  valor1  valor2
0     um      a       1       2
1     um      b       3       4
2     um      c       5       6
3     um      d       7       8
4   dois      a       9      10
5   dois      b      11      12
6   dois      c      13      14
7   dois      d      15      16

***Bcolz***: Um conteiner que l√™ arquivos com muitas linhas e 'zipa' ele:

### **Arquivos DF5**: Utilizado para **arquivos locais enormes** em formato **comprimido**

In [37]:
df5 = pd.DataFrame({'a': np.arange(10000)})
df5

         a
0        0
1        1
2        2
3        3
4        4
...    ...
9995  9995
9996  9996
9997  9997
9998  9998
9999  9999

[10000 rows x 1 columns]

In [38]:
path = pd.HDFStore('/content/drive/MyDrive/Data Science/Python para Analise de Dados/mydata.h5')
path['obj1'] = df5
path['obj1_col'] = df5['a']
path

<class 'pandas.io.pytables.HDFStore'>
File path: /content/drive/MyDrive/Data Science/Python para Analise de Dados/mydata.h5

In [39]:
path['obj1']

         a
0        0
1        1
2        2
3        3
4        4
...    ...
9995  9995
9996  9996
9997  9997
9998  9998
9999  9999

[10000 rows x 1 columns]

**Criando colunas e fazendo queries:**

Obs: HDFStore aceita dois esquemas de armazenagem: 'fixed' e 'table'. Table √© mais lento, por√©m aceita queries

In [40]:
path.put('obj2', df5, format='table')

Obs: path.put('obj2', df5, format='table') == path['obj2'] = df5

In [41]:
path.select('obj2', where=['index >= 30 and index <=50'])

     a
30  30
31  31
32  32
33  33
34  34
35  35
36  36
37  37
38  38
39  39
40  40
41  41
42  42
43  43
44  44
45  45
46  46
47  47
48  48
49  49
50  50

## **Trabalhando com arquivos excel:**

### **Abrindo arquivos em Excel:**

**Obs: Ambos os m√©todos fazem a mesma coisa, no entanto, ExcelFile √© mais r√°pido, principalmente quando se tratar de v√°rios arquivos**

In [42]:
xlsx = pd.ExcelFile('/content/drive/MyDrive/Data Science/Python para Analise de Dados/calendario.xlsx')
xlsx.parse()

  Unnamed: 0   0
0 1997-08-08   1
1 1997-08-09   2
2 1997-08-10   3
3 1997-08-11   4
4 1997-08-12   5
5 1997-08-13   6
6 1997-08-14   7
7 1997-08-15   8
8 1997-08-16   9
9 1997-08-17  10

In [43]:
xlsx2 = pd.read_excel('/content/drive/MyDrive/Data Science/Python para Analise de Dados/calendario.xlsx')
xlsx2

  Unnamed: 0   0
0 1997-08-08   1
1 1997-08-09   2
2 1997-08-10   3
3 1997-08-11   4
4 1997-08-12   5
5 1997-08-13   6
6 1997-08-14   7
7 1997-08-15   8
8 1997-08-16   9
9 1997-08-17  10

### **Salvando arquivos excel:**

In [44]:
writer = pd.ExcelWriter('/content/drive/MyDrive/Data Science/Python para Analise de Dados/exemplo2.xlsx')
df4.to_excel(writer)
writer.save()
df4

  chave1 chave2  valor1  valor2
0     um      a       1       2
1     um      b       3       4
2     um      c       5       6

In [45]:
xlsx2.to_excel('/content/drive/MyDrive/Data Science/Python para Analise de Dados/exemplo3.xlsx')

## **Trabalhando com dados de APIs web:**

In [46]:
import requests

In [47]:
 url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
 resp = requests.get(url)
 resp

In [48]:
dados = resp.json()
dados[0]['title']

'BUG: `truncate` has wrong behavior when the Index has only one unique value'

In [49]:
lista_bugs = pd.DataFrame(dados, columns=['number', 'title','labels', 'state'])

In [50]:
lista_bugs

    number  ... state
0    42365  ...  open
1    42364  ...  open
2    42363  ...  open
3    42362  ...  open
4    42361  ...  open
5    42360  ...  open
6    42359  ...  open
7    42358  ...  open
8    42357  ...  open
9    42356  ...  open
10   42355  ...  open
11   42354  ...  open
12   42353  ...  open
13   42352  ...  open
14   42351  ...  open
15   42350  ...  open
16   42349  ...  open
17   42347  ...  open
18   42346  ...  open
19   42345  ...  open
20   42343  ...  open
21   42340  ...  open
22   42339  ...  open
23   42338  ...  open
24   42335  ...  open
25   42333  ...  open
26   42332  ...  open
27   42331  ...  open
28   42329  ...  open
29   42328  ...  open

[30 rows x 4 columns]

## **Manipulando dados de banco de dados:**

In [51]:
import sqlite3

In [52]:
query = """
        CREATE TABLE teste(
          a VARCHAR(20),
          b VARCHAR(20),
          c FLOAT,
          d INT);"""

In [53]:
con = sqlite3.connect('/content/drive/MyDrive/Data Science/Python para Analise de Dados/mydata.sqlite', timeout=10)

In [54]:
con.commit()

In [55]:
dados_query = [('S√£o Paulo', 'Mogi das Cruzes', 1.25, 6),
               ('Minas Gerais', 'Belo Horizonte', 2.6, 3), 
               ('Rio Grande do Sul', 'Pelotas', 1.7, 5)]
stmt = "INSERT INTO teste VALUES(?, ?, ?, ?)"

In [56]:
con.executemany(stmt, dados_query)

In [57]:
tabela = con.execute('select * from teste')
linhas = tabela.fetchall()
linhas

[('S√£o Paulo', 'Mogi das Cruzes', 1.25, 6),
 ('Minas Gerais', 'Belo Horizonte', 2.6, 3),
 ('Rio Grande do Sul', 'Pelotas', 1.7, 5)]

In [58]:
colunas = tabela.description
colunas

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [59]:
df_sql = pd.DataFrame(linhas, columns=[x[0] for x in colunas])
df_sql

                   a                b     c  d
0          S√£o Paulo  Mogi das Cruzes  1.25  6
1       Minas Gerais   Belo Horizonte  2.60  3
2  Rio Grande do Sul          Pelotas  1.70  5